{
  "blogs": [
    {
      "id": 1,
      "title": "Big 5 Türkiye Yarışması ve Manifest Grubu",
      "image": "https://i.ytimg.com/vi/TWo7ktEPxSg/maxresdefault.jpg",
      "content": [
        "Türkiye'nin yeni müzik grubu oluşturma hedefiyle yola çıkan Big 5 Türkiye* yarışması, ilk sezonunu başarıyla tamamladı.",
        "Finale kalan 12 yetenekli yarışmacı arasından seçilen 6 isim, ülkenin yeni kız grubu olarak belirlendi.",
        "Jüri koltuğunda Tolga Akış, Gülçin Ergül ve Enes Abdulla gibi müzik dünyasının tanınmış isimlerinin oturduğu programda, yapılan titiz değerlendirmeler sonucunda Manifest* adını alan grup resmen kuruldu.",
        "Grubun çıkış şarkısı \"Zamansızdık\"*, kısa sürede büyük ilgi görerek müzik listelerinde hızla yükselmeyi başardı.",
        "",
        "### Manifest Grubunun Üyeleri ve Özellikleri",
        "",
        "- Sueda Uluca*: 20 yaşında olan Sueda, Özyeğin Üniversitesi'nde İletişim Tasarımı bölümünde eğitimine devam ediyor.",
        "10 yıldır dansla ilgileniyor ve son 3 yıldır dans eğitmenliği yapıyor.",
        "Yarışmaya sonradan katılan Sueda, güçlü vokali ve dans yetenekleriyle dikkat çekti.",
        "",
        "- Hilal Yelekçi*: 22 yaşında ve İstanbul Teknik Üniversitesi Bilgisayar Mühendisliği 4. sınıf öğrencisi.",
        "'Pinkeu' mahlasıyla tanınan Hilal, High Heels, Street Jazz, Hip-hop ve K-pop gibi çeşitli dans stillerine ilgi duyuyor.",
        "",
        "- Lidya Pınar*: 21 yaşında olan Lidya, Rus Dili ve Edebiyatı eğitimi görüyor.",
        "",
        "- Zeynep Sude Oktay*: 2001 doğumlu olan Zeynep, Marmara Üniversitesi Halkla İlişkiler ve Tanıtım Bölümü'nde eğitimine devam ediyor ve 5 yıldır profesyonel olarak dans ediyor.",
        "",
        "- Mina Solak*: 24 yaşında olan Mina, özel bir üniversitenin Sanat ve Kültür Yönetimi bölümünden mezun.",
        "Salsa dalında başarılı olan Mina, çeşitli ödüller kazanmış ve beş yıldır sahne deneyimi edinmiştir.",
        "",
        "- Esin Bahat*: Özel bir üniversitenin Psikoloji bölümünden mezun olan Esin, dans eğitimi almış ve kariyerine profesyonel dansçı ve dans eğitmeni olarak devam etmiştir.",
        "",
        "\"Zamansızdık\"* şarkısı, Big5 izleyicilerinden büyük beğeni toplarken global platformlarda yer alan şarkı daha ilk günlerden muazzam başarılar elde etti.",
        "Türkiye Spotify günlük chart listesinde bir günde en çok stream alan kız grup şarkıları arasında BLACKPINK'i geçen Manifest*, bu alanda ilk sıraya oturdu.",
        "\"Zamansızdık\" ayrıca Hande Yener ve Lil Zey'in* ‘Sahipsiz’ şarkısını geçerek bu yıl Spotify Türkiye'de en iyi açılış yapan kadın şarkısı oldu.",
        "",
        "Manifest grubu, müzik dünyasındaki kariyerlerinin ilk konserini geçtiğimiz akşam gerçekleştirdi.",
        "Yapılan ilk organizasyona binlerce hayran katıldı.",
        "",
        "Manifest'in bu hızlı yükselişi, Türkiye'nin müzik sahnesine taze bir soluk getirdi ve grubun gelecekteki projeleri merakla bekleniyor."
      ],
      "category": "Culture & Sound Blog",
      "date": "2025-03-11",
      "author": "Emirhan Körhan",
      "tags": [
        "Big 5 Türkiye",
        "Manifest",
        "Zamansızdık",
        "Sueda Uluca",
        "Hilal Yelekçi",
        "Lidya Pınar",
        "Zeynep Sude Oktay",
        "Mina Solak",
        "Esin Bahat"
      ]
    },
    {
      "id": 2,
      "title": "Mert Demir’in Skandalı: Gerçekten Suçlu Mu?",
      "content": [
        "Mert Demir, son dönemde medyanın en çok konuştuğu isimlerden biri haline geldi. Özellikle sosyal medyada paylaştığı bazı içerikler ve yaptığı açıklamalar, büyük bir skandala yol açtı. Birçok takipçisi, Demir’in paylaşımlarını şiddetle eleştirirken, bazıları ise onun haklı olduğuna inanıyor.",
        "Skandalın patlak vermesi, Mert Demir’in bir etkinlikte yaptığı konuşma ile başladı. Konuşmasında, birçok kişi tarafından yanlış anlaşılan ifadeler kullanan Demir, bu durumun ardından büyük bir tartışmanın içine girdi. Olayın ardından açıklama yapan Demir, sözlerinin yanlış anlaşıldığını ve kasıtlı olarak yapılmadığını belirtti.",
        "Ancak, sosyal medyada hızla yayılan eleştiriler, Demir’i oldukça zor durumda bıraktı. Birçok ünlü isim de Mert Demir’in bu açıklamalarına tepki gösterdi. Bazı takipçileri, onun bir örnek alması gereken biri olduğunu söylerken, bazıları ise onun çok daha dikkatli olması gerektiğini vurguladı.",
        "Mert Demir’in yaşadığı bu skandal, şüphesiz ki onun kariyerini derinden etkileyecek bir dönüm noktası olabilir. Ancak, skandalın sonuçları ne olursa olsun, Demir’in nasıl bir tavır sergileyeceği ve takipçileriyle ilişkilerini nasıl yeniden inşa edeceği, önümüzdeki günlerde merakla takip edilecek."
      ],
      "date": "2025-03-11",
      "image": "https://avatars.mds.yandex.net/i?id=6d1c892496d68a014359a741e9789c944cb0a18ddcf01d69-11846685-images-thumbs&n=13.jpeg",
      "category": "Social Trends Blog",
      "author": "lIrYmgMWLzfF8cqXS1Ejm0LnJ9q1"
    },
    {
      "id": 3,
      "title": "Yıldız Tilbe ve Sezen Aksu Kavgası: Sözlerden Gerçeklere",
      "content": [
        "Müzik dünyasının iki dev ismi, Yıldız Tilbe ve Sezen Aksu, son günlerde büyük bir kavganın ortasında kaldı. İki sanatçının arasındaki gerginlik, sosyal medyada büyük yankı uyandırırken, herkes birbirine soruyor: Bu kavga gerçekten neyin nesi?",
        "Kavganın başlangıcı, Yıldız Tilbe'nin Sezen Aksu hakkında yaptığı açıklamalarda gizli. Sezen Aksu’nun yıllarca müzik sahnesindeki başarılarının ve ününün arkasındaki sırrı sorgulayan Tilbe, kendini ifade etme şekliyle dikkat çekti. Bu açıklama, Aksu’nun hayranları tarafından sert bir şekilde eleştirildi.",
        "Ancak, Sezen Aksu da sessiz kalmadı. Uzun süredir sahneden uzak kalan Aksu, Tilbe’nin açıklamalarına karşı sert bir yanıt verdi. Bu karşılıklı eleştiriler, medyada ve sosyal medyada büyük bir tartışma başlattı. İki sanatçının arasındaki bu gerginlik, sadece müzik dünyasında değil, halk arasında da konuşulmaya başlandı.",
        "Yıldız Tilbe ve Sezen Aksu arasındaki bu kavga, her iki tarafın da kariyerine nasıl etki edeceği ve ilişkilerinin geleceği üzerine büyük bir soru işareti bırakıyor. Ancak, her iki sanatçının da güçlü kişilikleri ve sahne deneyimleri göz önüne alındığında, bu kavganın çok kısa süre içinde çözülmesi pek olası görünmüyor."
      ],
      "date": "2025-03-11",
      "image": "https://i.ytimg.com/vi/ERKQze9-TT8/maxresdefault.jpg",
      "category": "Music & Celebrity Blog",
      "author": "lIrYmgMWLzfF8cqXS1Ejm0LnJ9q1"
    },
    {
      "id": 4,
      "title": "Ayşe Barım Skandalı: Gerçekten Kendisini Savunabilecek Mi?",
      "content": [
        "Ayşe Barım, geçtiğimiz günlerde sosyal medyada büyük bir skandala imza atarak gündeme oturdu. Özellikle yaptığı açıklamalar ve paylaşımlar, pek çok kişi tarafından tepkiyle karşılandı. Birçok ünlü, skandalın ardından Ayşe Barım’ın kendisini savunması gerektiğini belirtti, ancak olayın perde arkası hala belirsiz.",
        "Ayşe’nin bu durumu nasıl atlatacağı ve kariyerine nasıl devam edeceği ise merak konusu. Pek çok kişi, onun geleceğini etkileyebilecek bu olayın, sosyal medya ve ünlüler dünyasında ne denli güçlü bir yansıma yarattığını tartışıyor.",
        "Ancak, tüm bu tepkilere rağmen, Ayşe’nin kendisini ve imajını nasıl toparlayacağı, onu takip edenler ve eleştirenler için en büyük soru işareti olarak kalıyor."
      ],
      "date": "2025-03-11",
      "image": "https://www.indyturk.com/sites/default/files/styles/1368x911/public/article/main_image/2025/01/24/1337013-1555643764.jpg?itok=pVRKqkHW",
      "category": "Social Trends Blog",
      "author": "lIrYmgMWLzfF8cqXS1Ejm0LnJ9q1"
    },
    {
      "id": 5,
      "title": "Hülya Avşar'ın Simit Yemelisiniz, Paranız Yoksa Skandalı",
      "content": [
        "Hülya Avşar, son dönemde yaptığı bir açıklama ile Türkiye’nin en çok konuştuğu isimlerinden biri haline geldi. Ünlü sanatçının, bir sosyal medya paylaşımında 'Simit Yemelisiniz, Paranız Yoksa' şeklindeki ifadeleri büyük bir tepki topladı. Avşar, açıklamasında maddi zorluklar çeken insanlara yönelik bu sözlerini sarf etmişti, ancak sözleri, sosyal medyada büyük bir tartışmaya yol açtı.",
        "Hülya Avşar’ın açıklamaları, özellikle ekonomik kriz ve yüksek enflasyon döneminde, birçok kişinin tepkisini çekti. Takipçileri, ünlü ismin yaptığı bu açıklamanın halktan uzak bir bakış açısı olduğunu savundu. Ancak bazı kesimler, Avşar’ın amacının maddi zorluklar çeken insanlara dair bir farkındalık yaratmak olduğunu belirtti.",
        "Medyanın büyük ilgi gösterdiği bu skandal, birçok ünlü tarafından da yorumlandı. Bazı isimler, Hülya Avşar’ın açıklamalarını eleştirirken, bazıları ise onun dikkat çekmeye çalıştığını savundu. Sosyal medya, Avşar’a yönelik eleştirilerle dolup taşarken, ünlü sanatçı da açıklamalarının yanlış anlaşılmaması gerektiğini vurguladı.",
        "Hülya Avşar’ın bu açıklamaları, hem kariyerini hem de halkla ilişkilerini nasıl etkileyeceği büyük bir merak konusu oldu. Gündeme bomba gibi düşen bu skandal, Avşar’ın nasıl bir açıklama yapacağı ve toplumla olan ilişkisini nasıl yeniden şekillendireceği konusunda soru işaretleri oluşturuyor."
      ],
      "date": "2025-03-11",
      "image": "https://i.ytimg.com/vi/rEARtUGzc-c/maxresdefault.jpg",
      "category": "Social Trends Blog",
      "author": "John Doe"
    },
    {
      "id": 6,
      "title": "Wanda Nara Borç Batağında: Skandalın Arkasında Ne Var?",
      "content": [
        "Wanda Nara, son dönemde medya dünyasında adını duyuran bir başka skandal ile gündemde. Ünlü model ve televizyon sunucusu, borç batağında olduğu iddialarıyla büyük bir tartışma başlattı. Sosyal medyada yayılan söylentilere göre Nara'nın, birikmiş borçları nedeniyle finansal bir kriz içinde olduğu ve bu durumun hayatını zora soktuğu öne sürülüyor.",
        "Skandalın patlak vermesi, Nara'nın yaptığı bazı açıklamalarla başladı. Ünlü isim, zorlu bir mali süreç geçirdiğini ve borçlarını ödemek için ciddi bir çaba sarf ettiğini belirtti. Ancak bu açıklama, birçok takipçisi tarafından şüpheyle karşılandı. Bazı sosyal medya kullanıcıları, Nara'nın borçlarının aslında çok daha büyük olduğunu ve kamuoyuna gerçekleri tam olarak açıklamadığını iddia etti.",
        "Nara'nın borç batağındaki durumu, birçok ünlü ismin de tepkisini çekti. Finansal sorunları gündeme getiren bu olay, onu yalnızca kendi dünyasında değil, sosyal medya platformlarında da tartışma konusu yaptı. Kimileri, Wanda Nara'nın bu durumu aşacağına inanırken, bazıları ise onun finansal yönetim konusunda daha dikkatli olması gerektiğini vurguladı.",
        "Borç batağında olduğu iddia edilen Wanda Nara’nın durumu, hem kişisel hayatını hem de kariyerini etkileyebilir. Skandalın sonuçları ne olursa olsun, Nara'nın bu krizi nasıl yöneteceği ve takipçileriyle ilişkilerini nasıl yeniden kuracağı büyük bir merak konusu olmaya devam ediyor."
      ],
      "date": "2025-03-11",
      "image": "https://karadenizgazete.com.tr/Uploads/news/113202512266681manset-1140-568-haber-2-kurtarildi-kurtarildi-kurtarildi-kurtarildi-kurtarildi-kurtarildi-kurtarildi-kurtarildi-kurtarildi-kurtarildi-kurtarildi-kurtarildi.jpg",
      "category": "Social Trends Blog",
      "author": "lIrYmgMWLzfF8cqXS1Ejm0LnJ9q1"
    },
    {
      "title": "merhaba",
      "author": "merhaba",
      "date": "2025-03-15",
      "category": "awd",
      "image": "awdawd",
      "content": "awdawd",
      "id": 7
    },
    {
      "title": "a",
      "author": "a",
      "date": "2025-03-22",
      "category": "a",
      "image": "a",
      "content": "a",
      "id": 8
    }
  ],
  "users": [
    {
      "id": 1,
      "email": "boranaybike19@gmail.com",
      "password": "$2b$10$VYbRJ/Xp0R0UEuY6gWfM0.3d9XX9BHVF/S1PicXS/TD/erBRv9v9m",
      "role": "admin"
    },
    {
      "id": 2,
      "email": "saridas.beyzaa@gmail.com",
      "password": "$2a$12$GAW2Q///G4rnh56cqEOHIOrMscHQi0MJ0UP.iIqzIRpGMYxGXWl26",
      "role": "admin"
    },
    {
      "id": "lIrYmgMWLzfF8cqXS1Ejm0LnJ9q1",
      "email": "korhanemirhann@gmail.com",
      "password": "23232323",
      "username": "sasawd"
    }
  ]
}