[
    {
      "id": 1,
      "author": "Sedanur Ceylan",
      "date": "24/07/2025",
      "title": "Bilim Kurgu Filmlerinin Geleceği Nasıl Şekillendirdiği",
      "detail": "Bilim kurgu filmlerinin teknolojik gelişmelere etkisi nedir?",
      "content": "Bilim kurgu filmleri, yalnızca eğlence sunmakla kalmaz, aynı zamanda teknolojik gelişmelere ilham kaynağı olur. Örneğin, '2001: A Space Odyssey' yapay zeka ve uzay keşfi hakkında ön görüler sunarken, 'Minority Report' dokunmatik ekran teknolojisinin öncüsü olmuştur. Bu tür filmler, hem bilim insanları hem de mühendisler için büyük bir motivasyon kaynağıdır. Yapay zeka, uzay keşfi ve sanal gerçeklik gibi birçok teknolojinin bu filmlerden ilham aldığını söylemek mümkündür.",
      "image": "/../images/sci-fi-movies.jpeg"
    },
    {
      "id": 2,
      "author": "Sedanur Ceylan",
      "date": "10/09/2025",
      "title": "Korku Filmlerinin Psikolojik Etkileri",
      "detail": "Korku filmleri insan psikolojisini nasıl etkiler?",
      "content": "Korku filmleri izlemek, adrenalini artırarak izleyicinin hem eğlenmesini hem de korku duygusunu deneyimlemesini sağlar. Ancak, yapılan araştırmalara göre, korku filmleri bazı kişilerde stres seviyesini yükseltebilir ve uyku bozukluklarına neden olabilir. Öte yandan, kontrollü korku deneyimleri, kişinin korkularıyla yüzleşmesine yardımcı olabilir. Psikologlar, korku filmlerinin beyindeki dopamin ve endorfin salgılanmasını artırarak bazı insanlarda keyif verici bir deneyim sunduğunu belirtiyor.",
      "image": "/images/horror-movies.jpg"
    },
    {
      "id": 3,
      "author": "Beyza Cankurtaran",
      "date": "05/10/2025",
      "title": "Dünyanın En İlginç Festivalleri",
      "detail": "Dünyada mutlaka görülmesi gereken eğlenceli festivaller hangileri?",
      "content": "Dünyanın dört bir yanında düzenlenen festivaller, kültürel mirası yansıtan ve eğlencenin doruklarına ulaşan etkinliklerdir. Örneğin, İspanya'daki 'La Tomatina' festivali, insanların birbirine domates atarak kutlama yaptığı çılgın bir etkinliktir. Hindistan'daki Holi Festivali, rengarenk tozlarla yapılan bir bahar kutlamasıdır. Japonya’da düzenlenen Gion Matsuri, geleneksel geçit törenleri ve renkli kıyafetlerle dikkat çeker. Bu festivaller, farklı kültürleri keşfetmek ve unutulmaz anılar biriktirmek isteyenler için mükemmel bir fırsattır.",
      "image": "/images/world-festivals.jpeg"
    },
    {
      "id": 4,
      "author": "Beyza Cankurtaran",
      "date": "20/11/2025",
      "title": "Zekâ Geliştiren Eğlenceli Oyunlar",
      "detail": "Hangi oyunlar zekâyı geliştirir?",
      "content": "Oyun oynamak sadece eğlenceli değil, aynı zamanda beyin gelişimi için de oldukça faydalıdır. Strateji ve bulmaca oyunları, hafıza ve problem çözme becerilerini geliştirir. Örneğin, satranç zihinsel planlama yeteneğini artırırken, Sudoku sayısal zekayı geliştirir. Video oyunları arasında ise 'Portal' gibi fizik tabanlı bulmacalar içeren oyunlar, analitik düşünme yeteneğini destekler. Beyin jimnastiği yapmak isteyenler için bu tür oyunlar harika bir seçenektir.",
      "image": "/images/brain-games.jpeg"
    },
    {
      "id": 5,
      "author": "Furkan Fırat",
      "date": "15/12/2025",
      "title": "Gece Gökyüzünü İzlemenin Sırları",
      "detail": "Yıldızları izlerken nelere dikkat etmelisiniz?",
      "content": "Gökyüzünü izlemek, hem bilimsel hem de meditatif bir aktivitedir. Yıldızları en iyi şekilde görmek için ışık kirliliğinden uzak noktalara gitmek önemlidir. Astronomi meraklıları, teleskop veya dürbün kullanarak Ay’ın yüzeyini detaylı bir şekilde inceleyebilir. Ayrıca, yıldız haritaları ve mobil uygulamalar sayesinde hangi yıldızın nerede olduğunu kolayca keşfedebilirsiniz. Perseid meteor yağmuru gibi özel gökyüzü olaylarını takip etmek ise unutulmaz bir deneyim sunar.",
      "image": "/images/star-gazing.jpeg"
    },
    {
      "id": 6,
      "author": "Furkan Fırat",
      "date": "30/01/2026",
      "title": "Zamanda Yolculuk: Teori mi Gerçek mi?",
      "detail": "Zamanda yolculuk mümkün mü?",
      "content": "Zamanda yolculuk, bilim insanlarının ve bilim kurgu yazarlarının en çok ilgisini çeken konulardan biridir. Einstein'ın görelilik teorisine göre, ışık hızına yakın bir hızda hareket eden bir nesne için zaman yavaşlar. Bu, teorik olarak zamanda ileri gitmenin mümkün olduğunu gösterir. Ancak, geçmişe gitmek hâlâ büyük bir soru işareti olarak duruyor. Solucan delikleri gibi kavramlar teoride mümkün olsa da, şu anki teknoloji ile hayata geçirilmesi oldukça zor. Yine de, bilim dünyasında zamanın doğası hakkındaki araştırmalar hız kesmeden devam ediyor.",
      "image": "/images/time-travel.jpg"
    }
  ]