{
  "blogs": [  {
    "id": 1,
    "title": "Ege'nin Gizemli Köyleri",
    "content": "Ege Bölgesi, Türkiye'nin en huzurlu ve tarihi zenginliklerle dolu bölgelerinden biridir. Bu yazımızda, Ege'nin bilinmeyen köylerine doğru bir yolculuğa çıkacağız. Doğal güzellikleri, tarihi yapıları ve sakin atmosferleriyle dikkat çeken bu köylerde, şehir hayatından uzaklaşarak huzur bulabilirsiniz. Ege'nin gizemli köylerini keşfetmek için hazırsanız, okumaya devam edin.",
    "category": "Seyahat",
    "image": "https://www.filgezi.com/wp-content/uploads/2018/07/karaburun.jpg",
    "creator": "Aybike",
    "date": "2025-02-19"
  },
  {
    "id": 2,
    "title": "İstanbul'da Gezilecek 5 Yer",
    "content": "İstanbul, hem tarihi hem de modern yapılarıyla gezilip görülecek birçok mekâna ev sahipliği yapıyor. Eğer İstanbul'da ne yapacağınızı bilmiyorsanız, işte size birkaç öneri. Sultanahmet Meydanı, Ayasofya, Topkapı Sarayı gibi klasiklerin yanı sıra, Galata Kulesi ve Kadıköy'deki sokak sanatlarını keşfetmek de İstanbul'da yapılacaklar listenizde olmalı.",
    "category": "Seyahat",
    "image": "https://imageio.forbes.com/specials-images/imageserve/64e5337c540d1790114af6bf/Aerial-view-of-Galata-Tower--Blue-Mosque---Hagia-Sophia--ayasofya--in-Istanbul/960x0.jpg?format=jpg&width=1440",
    "creator": "Cansu",
    "date": "2025-02-18"
  },
  {
    "id": 3,
    "title": "Kapadokya'da Balon Turu",
    "content": "Kapadokya, benzersiz kaya oluşumları ve peri bacalarıyla ünlü bir bölgedir. Ancak burayı özel kılan bir diğer şey ise sıcak hava balonlarıyla yapılan turlardır. Güneşin doğuşu eşliğinde balonla yapılan bu turlar, Kapadokya'nın eşsiz manzarasını havadan görmek için harika bir fırsat sunuyor. Balon turları hakkında bilmeniz gerekenler ve unutulmaz bir deneyim için yapmanız gerekenler hakkında detaylar yazımızda.",
    "category": "Seyahat",
    "image": "https://www.kapadokyabalonturlari.com.tr/assets/images/gallery/product/kapadokya-balon-turu_17.jpg",
    "creator": "Kadriye",
    "date": "2025-02-17"
  }]

  }