{
  "products": [
    {
      "id": "1",
      "title": "Sınırda Kalan Öğrencisini Dersten Geçiren Üniversite Profesörü",
      "price": "982,99",
      "img": "/professor.jpg",
      "description": "Kampüs efsanelerine hayat veren, sınırda kalan öğrenciler için gerçek bir kurtarıcı! Bu profesör, yalnızca akademik notları değil, aynı zamanda öğrencilerin hayallerini de yükseltiyor. Ders geçmek için bir mucizeye ihtiyaç duyanların umudu olan bu ürün, Bir puanla kaçırdım gibi sorunlara kesin çözüm sunuyor. Stres altındaki öğrencilerin yanında durmayı kendine görev edinmiş, tam bir uzman. "
    },
    {
      "id": "2",
      "title": "Geliniyle İyi Geçinen Nur Yüzlü Melek Kaynana ",
      "price": "3580,99",
      "img": "/kaynana.jpg",
      "description": "Evdeki huzurun gerçek mimarı, gelinini kendi kızından farksız seven bu kaynana, aile içindeki en büyük dengeyi sağlıyor. Her durumda yapıcı ve anlayışlı, asla tartışmalara dahil olmayan, hep çözüm odaklı bir yaklaşım sergiliyor. ‘Gelinimle aramda hiçbir sorun yok’ diyerek, tüm aileyi bir arada tutmayı başarıyor. Güven, sevgi ve empatiyle, geliniyle güçlü bir bağ kuran bu kaynana, evin en değerli sırrı! "
    },
    {
      "id": "3",
      "title": "Ghosting & Gaslighting & Lovebombing İçermeyen İlişki ",
      "price": "7.950,50",
      "img": "/couple.jpg",
      "description": "Modern ilişkilerin karmaşıklıklarından uzak, dürüstlük ve saygı temelli bir bağ arayanlar için. Artık manipülasyon, kafa karışıklığı ve oyunlar yok! Ghosting, gaslighting ve lovebombing'in yer almadığı, tamamen sağlıklı bir ilişki anlayışı. Kendinizi güvende hissedeceğiniz, her adımda şeffaflık ve empatiyle ilerleyeceğiniz bir ilişki modeli. Sadece sevgi, anlayış ve saygı ile örülmüş gerçek bir bağ!"
    },
    {
      "id": "4",
      "title": "Çay Bile Koyan Sevgi Dolu Masrafsız Tekir Kedi ",
      "price": "12,99",
      "img": "/cat.jpg",
      "description": "Huzurlu ve sevgi dolu bir ev ortamı arayanlar için mükemmel bir seçenek! Çayınızı koyan, evin içinde neşeyle dolaşan ve sizi asla yalnız bırakmayan masrafsız, bakımı kolay bir tekir kedi. O, sadece bir evcil hayvan değil, aynı zamanda yaşam alanınızı güzelleştiren, ruh halinizi yükselten gerçek bir dost. Evin her köşesinde size eşlik ederken, bakımı hiç zahmetli olmaz. Kendi küçük dünyasında mutluluğu bulan bu tatlı tekir, size sadece sevgi ve huzur sunacak. "
    },
    {
      "id": "5",
      "title": "Atış Menzili Düşük Hasarı Az Acıtmayan Anne Terliği ",
      "price": "210.25",
      "img": "/terlik.jpg",
      "description": "Her evde olması gereken bir kahraman: Atış menzili düşük, hasarı az, ama acıtmayan anne terliği! Klasik anne terliği, evde huzur ve düzeni sağlamak için tasarlandı. Özellikle evin içinde gezinen, yemek masasına oturmuş olan çocukların etrafında, ani bir refleksle güçlü darbeler yapabilen bu terlik, aynı zamanda kimseyi acıtmadan etkili. "
    },
    {
      "id": "6",
      "title": "Size Döneceğiz Diyip Gerçekten Dönen İnsan Kaynakları Müdürü ",
      "price": "1089,99",
      "img": "/insnkaynak.jpg",
      "description": "İşe alım sürecinin en güvenilir kahramanı! Size döneceğiz dediği anda gerçekten dönen, güven veren bir İnsan Kaynakları Müdürü. Hiçbir kandırmaca, yok sayma ya da unutturma yok. Başvurunuzla ilgilenen ve her aşamada sizi bilgilendiren, adım adım takip eden bir profesyonel. İstediğiniz her konuda net ve hızlı geri dönüş alırsınız. Bir iş görüşmesinden sonra gerçek anlamda sizi unutmayan, her adımda profesyonellik gösteren bir İnsan Kaynakları Müdürü ile iş hayatınızda başarıya ulaşın!  "
    },
    {
      "id": "7",
      "title": "Haber Vermeden Gelmeyen Dedikodu Yapmayan Akrabalar",
      "price": "2.350,30",
      "img": "/akraba.jpg",
      "description": "Evdeki huzuru bozan, haber vermeden gelen akrabalara veda edin! Bu akrabalar, tam zamanında ve her şey yerli yerinde kalacak şekilde gelirler. Hiçbir şekilde dedikodu yapmaz, kimseyi huzursuz etmezler. Birbirlerini sevdikleri kadar sizi de takdir eder, evin neşesini bozmadan tüm sohbetlere katılırlar. Klasik akraba ziyaretlerinin aksine, sadece keyifli anlar yaşatmak için gelir, bırakıp giderler. Sizin ve evinizin huzuru, onların en büyük önceliğidir! "
    },
    {
      "id": "8",
      "title": "Büyü Yapmayan İyilik Timsali Yüreği Sevgi Dolu Yenge",
      "price": "867,99 ",
      "img": "/yenge.jpg",
      "description": "İhtiyacınız olan tek şey: Yüreği sevgiyle dolu, ama kesinlikle büyü yapmayan bir yenge! Bu ürün, hayatınızı iyilik ve şefkatle sarar, ama ne yazık ki hiçbir zaman size büyüyle pratik çözümler sunmaz. Yenge, her konuda yanınızda; gönlünüzü alır, moral verir, ama anında Bu konuda bir büyü yapamam, ama elinizden geleni yapın! diyerek gerçekçi bir yaklaşım sunar. Eğer hep Büyü yapacak yenge arıyorsanız, bu ürün tam size göre değil! "
    },
    {
      "id": "9",
      "title": "Kesinlikle Revize İstemeyen Paranızı Anında Yatıran İşveren",
      "price": "28.290,30",
      "img": "/isveren.jpg",
      "description": "Hayatınızdaki en güzel şey: Revize istemeyen, işinizi hemen onaylayan ve paranızı anında yatıran işveren! Bu işveren, her projeyi tam olarak istediğiniz gibi kabul eder, Revize gerekmiyor diyerek sizi rahatlatır ve parayı cebe koyarsınız! Bütün bu sürecin sonunda, iş yerinde gerilim, stres ve o meşhur revize kelimesi yoktur. Sadece mutlu bir çalışan ve zamanında ödeme! "
    }
  ]
}
