[
    {
      "id": 1,
      "title": "Big 5 Türkiye Yarışması ve Manifest Grubu",
      "image":"https://i.ytimg.com/vi/TWo7ktEPxSg/maxresdefault.jpg",
"content": [
"Türkiye'nin yeni müzik grubu oluşturma hedefiyle yola çıkan Big 5 Türkiye* yarışması, ilk sezonunu başarıyla tamamladı.",
"Finale kalan 12 yetenekli yarışmacı arasından seçilen 6 isim, ülkenin yeni kız grubu olarak belirlendi.",
"Jüri koltuğunda Tolga Akış, Gülçin Ergül ve Enes Abdulla gibi müzik dünyasının tanınmış isimlerinin oturduğu programda, yapılan titiz değerlendirmeler sonucunda Manifest* adını alan grup resmen kuruldu.",
"Grubun çıkış şarkısı \"Zamansızdık\"*, kısa sürede büyük ilgi görerek müzik listelerinde hızla yükselmeyi başardı.",
"",
"### Manifest Grubunun Üyeleri ve Özellikleri",
"",
"- Sueda Uluca*: 20 yaşında olan Sueda, Özyeğin Üniversitesi'nde İletişim Tasarımı bölümünde eğitimine devam ediyor.",
"10 yıldır dansla ilgileniyor ve son 3 yıldır dans eğitmenliği yapıyor.",
"Yarışmaya sonradan katılan Sueda, güçlü vokali ve dans yetenekleriyle dikkat çekti.",
"",
"- Hilal Yelekçi*: 22 yaşında ve İstanbul Teknik Üniversitesi Bilgisayar Mühendisliği 4. sınıf öğrencisi.",
"'Pinkeu' mahlasıyla tanınan Hilal, High Heels, Street Jazz, Hip-hop ve K-pop gibi çeşitli dans stillerine ilgi duyuyor.",
"",
"- Lidya Pınar*: 21 yaşında olan Lidya, Rus Dili ve Edebiyatı eğitimi görüyor.",
"",
"- Zeynep Sude Oktay*: 2001 doğumlu olan Zeynep, Marmara Üniversitesi Halkla İlişkiler ve Tanıtım Bölümü'nde eğitimine devam ediyor ve 5 yıldır profesyonel olarak dans ediyor.",
"",
"- Mina Solak*: 24 yaşında olan Mina, özel bir üniversitenin Sanat ve Kültür Yönetimi bölümünden mezun.",
"Salsa dalında başarılı olan Mina, çeşitli ödüller kazanmış ve beş yıldır sahne deneyimi edinmiştir.",
"",
"- Esin Bahat*: Özel bir üniversitenin Psikoloji bölümünden mezun olan Esin, dans eğitimi almış ve kariyerine profesyonel dansçı ve dans eğitmeni olarak devam etmiştir.",
"",
"\"Zamansızdık\"* şarkısı, Big5 izleyicilerinden büyük beğeni toplarken global platformlarda yer alan şarkı daha ilk günlerden muazzam başarılar elde etti.",
"Türkiye Spotify günlük chart listesinde bir günde en çok stream alan kız grup şarkıları arasında BLACKPINK'i geçen Manifest*, bu alanda ilk sıraya oturdu.",
"\"Zamansızdık\" ayrıca Hande Yener ve Lil Zey'in* ‘Sahipsiz’ şarkısını geçerek bu yıl Spotify Türkiye'de en iyi açılış yapan kadın şarkısı oldu.",
"",
"Manifest grubu, müzik dünyasındaki kariyerlerinin ilk konserini geçtiğimiz akşam gerçekleştirdi.",
"Yapılan ilk organizasyona binlerce hayran katıldı.",
"",
"Manifest'in bu hızlı yükselişi, Türkiye'nin müzik sahnesine taze bir soluk getirdi ve grubun gelecekteki projeleri merakla bekleniyor."
],
      "category": "Culture & Sound Blog",
      "date": "2025-03-11",
      "author": "Emirhan Körhan",
      "tags" : ["Big 5 Türkiye", "Manifest", "Zamansızdık", "Sueda Uluca", "Hilal Yelekçi", "Lidya Pınar", "Zeynep Sude Oktay", "Mina Solak", "Esin Bahat"]
    },
    {
      "id":2,
      "title": "Zendaya’nın Yükselişi: Sadece Yeteneğiyle Mi Burada?",
      "content": "Hollywood’un yeni jenerasyonunun en parlak isimlerinden biri olan Zendaya, yeteneği ve çok yönlü kariyeriyle adından sıkça söz ettiriyor. Hem oyunculuk hem de müzik dünyasında başarılar elde eden Zendaya, sadece yeteneğiyle değil, kişisel özellikleri ve samimi tavırlarıyla da büyük bir hayran kitlesi yaratmış durumda. Peki, onu diğerlerinden ayıran ne? Zendaya’nın en büyük farkı, hem ekran önünde hem de kamera arkasında gösterdiği özverili çalışma. Oyunculuk kariyerine başladığı günden itibaren sergilediği başarılar, onu genç yaşta Hollywood’un en aranan isimlerinden biri haline getirdi. Euphoria dizisindeki rolüyle adını duyuran Zendaya, bu projede sergilediği performansıyla büyük bir beğeni topladı. Sadece oyunculuk değil, müzikle de ilgilenen Zendaya, müzik kariyerinde de önemli adımlar atarak çok yönlü bir sanatçı kimliğini benimsedi. Ancak Zendaya’yı sadece yetenekleriyle değil, aynı zamanda sosyal medyada hayranlarıyla kurduğu içten ilişkilerle de tanıyoruz. Zendaya, takipçileriyle sürekli olarak etkileşimde bulunarak, onları sadece birer izleyici değil, aynı zamanda yol arkadaşları olarak görüyor. Bu samimi yaklaşımı, onun daha da yakın ve ulaşılabilir bir figür olmasını sağlıyor. Kendisini olduğu gibi gösteriyor ve takipçilerine gerçek bir bağlantı sunuyor. Özel hayatını ise oldukça gizli tutmayı tercih eden Zendaya, medyanın sürekli ilgisine rağmen kişisel sınırlarını koruyor. Bu tavrı, onu daha gizemli ve saygı duyulası bir figür haline getiriyor. Hem kameralarda hem de özel hayatında dengeyi sağlamayı başaran Zendaya, Hollywood’un en takdir edilen genç yıldızlarından biri olmayı sürdürüyor. Zendaya, hem yetenekleri hem de kişisel duruşuyla Hollywood’daki başarısını sadece bir kariyer değil, bir yaşam biçimi haline getirdi. Onun hikayesi, sadece genç sanatçılar için değil, her yaştan insan için ilham verici bir yolculuk.",      "date": "2025-03-11",
      "image": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Timoth%C3%A9e_Chalamet_2017_Berlinale.jpg",
      "category": "Culture & Fame Blog",
      "author": "Beyza Sarıdaş"
    },
    {
     "id": 3,
"title": "Yıldız Tilbe ve Sezen Aksu Kavgası: Sözlerden Gerçeklere",
"content": [
"Müzik dünyasının iki dev ismi, Yıldız Tilbe ve Sezen Aksu, son günlerde büyük bir kavganın ortasında kaldı. İki sanatçının arasındaki gerginlik, sosyal medyada büyük yankı uyandırırken, herkes birbirine soruyor: Bu kavga gerçekten neyin nesi?",
"Kavganın başlangıcı, Yıldız Tilbe'nin Sezen Aksu hakkında yaptığı açıklamalarda gizli. Sezen Aksu’nun yıllarca müzik sahnesindeki başarılarının ve ününün arkasındaki sırrı sorgulayan Tilbe, kendini ifade etme şekliyle dikkat çekti. Bu açıklama, Aksu’nun hayranları tarafından sert bir şekilde eleştirildi.",
"Ancak, Sezen Aksu da sessiz kalmadı. Uzun süredir sahneden uzak kalan Aksu, Tilbe’nin açıklamalarına karşı sert bir yanıt verdi. Bu karşılıklı eleştiriler, medyada ve sosyal medyada büyük bir tartışma başlattı. İki sanatçının arasındaki bu gerginlik, sadece müzik dünyasında değil, halk arasında da konuşulmaya başlandı.",
"Yıldız Tilbe ve Sezen Aksu arasındaki bu kavga, her iki tarafın da kariyerine nasıl etki edeceği ve ilişkilerinin geleceği üzerine büyük bir soru işareti bırakıyor. Ancak, her iki sanatçının da güçlü kişilikleri ve sahne deneyimleri göz önüne alındığında, bu kavganın çok kısa süre içinde çözülmesi pek olası görünmüyor."
],
"date": "2025-03-11",
"image": "https://i.ytimg.com/vi/ERKQze9-TT8/maxresdefault.jpg",
"category": "Music & Celebrity Blog",
"author": "John Doe"
    },
    {
      "id":4,
      "title": "Ayşe Barım Skandalı: Gerçekten Kendisini Savunabilecek Mi?",
      "content": [
        "Ayşe Barım, geçtiğimiz günlerde sosyal medyada büyük bir skandala imza atarak gündeme oturdu. Özellikle yaptığı açıklamalar ve paylaşımlar, pek çok kişi tarafından tepkiyle karşılandı. Birçok ünlü, skandalın ardından Ayşe Barım’ın kendisini savunması gerektiğini belirtti, ancak olayın perde arkası hala belirsiz.",
        "Ayşe’nin bu durumu nasıl atlatacağı ve kariyerine nasıl devam edeceği ise merak konusu. Pek çok kişi, onun geleceğini etkileyebilecek bu olayın, sosyal medya ve ünlüler dünyasında ne denli güçlü bir yansıma yarattığını tartışıyor.",
        "Ancak, tüm bu tepkilere rağmen, Ayşe’nin kendisini ve imajını nasıl toparlayacağı, onu takip edenler ve eleştirenler için en büyük soru işareti olarak kalıyor."
        ],
      "date": "2025-03-11",
      "image": "https://www.indyturk.com/sites/default/files/styles/1368x911/public/article/main_image/2025/01/24/1337013-1555643764.jpg?itok=pVRKqkHW",
      "category": "Social Trends Blog",
      "author": "John Doe"
    }
  ]