{
  "books": [
    {
      "id": "1",
      "title": "Ruhu Kırık Adam",
      "author": "Emirhan Körhan",
      "year": "2022",
      "description": "Bir kitapta karşılaştım seninle. Çizdim adının üstünü, düşünmedim bir zerre bile. Bir yolda gördüm seni, parke taşları kırık döküktü, ruhum gibi. Sokak lambaları mahzun yanar halde, dudakların ıslak ıslaktı. Gözlerinde yanan ateşe rağmen, üşüyordu bedenin ve düşüyordu her saniye aklımdan.",
      "available": true,
      "imgUrl": "https://img.kitapyurdu.com/v1/getImage/fn:12023972/wh:true/wi:220",
      "paperType": "1. Hamur",
      "size": "13 x 19.5 cm",
      "printCount": 1,
      "publisher": "Can Yayınları"
    },
    {
      "id": "2",
      "title": "1984",
      "author": "George Orwell",
      "year": 1949,
      "description": "George Orwell’in kült kitabı Bin Dokuz Yüz Seksen Dört, yazarın geleceğe ilişkin bir kâbus senaryosudur. Bireyselliğin yok edildiği, zihnin kontrol altına alındığı, insanların makineleşmiş kitlelere dönüştürüldüğü totaliter bir dünya düzeni, romanda inanılmaz bir hayal gücüyle, en ince ayrıntısına kadar kurgulanmıştır. Geçmişte ve günümüzde dünya sahnesinde tezgâhlanan oyunlar düşünüldüğünde, ütopik olduğu kadar gerçekçi bir romandır Bin Dokuz Yüz Seksen Dört. Güncelliğini hiçbir zaman yitirmeyen bir başyapıttır; yalnızca yarına değil, bugüne de ilişkin bir uyarı çığlığıdır.",
      "available": true,
      "imgUrl": "https://m.media-amazon.com/images/I/71kxa1-0mfL.jpg",
      "paperType": "2. Hamur",
      "size": "13,5 x 21 cm",
      "printCount": 56,
      "publisher": "Aksöz Yayınevi"
    },
    {
      "id": "3",
      "title": "Sapiens",
      "author": "Yuval Noah Harari",
      "year": 2011,
      "description": "İnsanların miadı çoktan doldu mu? 100 bin yıl önce Yeryüzü’nde en az altı farklı insan türü vardı. Günümüzdeyse sadece Homo Sapiens var. Diğerlerinin başına ne geldi ve bize ne olacak? Çoğu çalışma insanlığın serüvenini ya tarihi ya da biyolojik bir yaklaşımla ele alır, ancak Harari 70 bin yıl önce gerçekleşen Bilişsel Devrim’le başlattığı bu kitabında gelenekleri yerle bir ediyor. İnsanların küresel ekosistemde oynadıkları rolden imparatorlukların yükselişine ve modern dünyaya kadar pek çok konuyu irdeleyen Sapiens, tarihle bilimi bir araya getirerek kabul görmüş anlatıları yeniden ele alıyor. Harari ayrıca geleceğe bakmaya da zorluyor okuru. Yakın zamanda insanlar, dört milyar yıldır yaşama hükmeden doğal seçilim yasalarını esnetmeye başladılar. Artık sadece dünyayı değil, kendimizi ve diğer canlıları tasarlama becerisi de kazandık.",
      "available": false,
      "imgUrl": "https://m.media-amazon.com/images/I/713jIoMO3UL.jpg",
      "paperType": "Şamua",
      "size": "16 x 24 cm",
      "printCount": 42,
      "publisher": "Kılıç Yayınevi"
    },
    {
      "id": "4",
      "title": "Hayvan Çiftliği",
      "author": "George Orwell",
      "year": 1945,
      "description": "İngiliz yazar George Orwell (1903-1950), ülkemizde daha çok 1984 adlı kitabıyla tanınır. Hayvan Çiftliği, onun çağdaş klasikler arasına girmiş ikinci ünlü yapıtıdır. 1940'lardaki 'reel sosyalizm'in eleştirisi olan bu roman, dünya edebiyatında 'yergi' türünün başyapıtlarından biridir. Hayvan Çiftliği'nin kişileri hayvanlardır. George Orwell, bu romanında tarihsel bir gerçeği eleştirmektedir. Romandaki önder domuzun, düpedüz Stalin'i simgelediği açıkça görülecektir. Öbür kişiler bire bir belli olmasalar da, bir diktatörlük ortamında yer albilecek kişilerdir. Romanın alt başlığı Bir Peri Masalı'dır. Küçükleri eğlendirecek bir peri masalı değildir; ama roman, bir masal anlatımıyla yazılmıştır.",
      "available": true,
      "imgUrl": "https://asset.kitapsepeti.com/hayvan-ciftligi-72141-207585-72-O.jpg",
      "paperType": "2. Hamur",
      "size": "13 x 19,5 cm",
      "printCount": 85,
      "publisher": "Can Yayınları"
    },
    {
      "id": "5",
      "title": "Suç ve Ceza",
      "author": "Fyodor Dostoyevski",
      "year": 1866,
      "description": "Hemen şimdi bir şeyler yapmak gerek,” diye söylenir Raskolnikov. “Ne olursa olsun bir şeyler yapmak için karar vermek ya da büsbütün yaşamaktan vazgeçmek...” Yoksul ve onurlu Raskolnikov’un tavan arasındaki öğrenci odasında yaşadığı ikilem ve sonrasında tasarladığı cinayet Rusya’da bir fırtınanın kopmasına neden olmuştu. Suç ve Ceza farklı  dillere çevrildiğinde, yazarı Dostoyevski’yi dünya edebiyatının zirvesine taşıdı. Yüz elli yıllık bu başyapıt hâlâ en çok sevilen ve en çok okunan romanlar arasında. Çünkü zaman, Suç ve Ceza’nın ele aldığı meseleleri eskitemedi.",
      "available": false,
      "imgUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0000000222779-1.jpg",
      "paperType": "1. Hamur",
      "size": "14 x 20 cm",
      "printCount": 68,
      "publisher": "Aksöz Yayınevi"
    },
    {
      "id": "6",
      "title": "Bilinmeyen Bir Kadının Mektubu",
      "author": "Stefan Zweig",
      "year": 1922,
      "description": "Bu kitapta kim olduğu bilinmeyen bir kadın, hayatı boyunca uzaktan sevdiği  ünlü roman yazarı R’ye duygularını anlatmak için bir mektup yazıyor. Yani hikayenin ismi boşuna ‘‘Bilinmeyen Bir Kadının Mektubu’’ değil ve bu mektup da boşuna Beni hiç tanımamış olan sana” diye başlamıyor. Kitapta yer alan  Erika Ewald'in Aşkı ve Unutulmuş Düşler isimli  diğer iki öykü de, Bilinmeyen Bir Kadının Mektubu'nda olduğu gibi, Psikanalitik kuramın öncülerinden Sigmund Freud'un Stefan Zweig üzerindeki etkisine dair ipuçları taşıyor",
      "available": true,
      "imgUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0000000411059-1.jpg",
      "paperType": "Şamua",
      "size": "12 x 18 cm",
      "printCount": 37,
      "publisher": "Kılıç Yayınevi"
    },
    {
      "id": "7",
      "title": "Dönüşüm",
      "author": "Franz Kafka",
      "year": 1915,
      "description": "Gregor Samsa, bir sabah, huzursuz edici rüyalarından uyandığında, devasa bir böceğe dönüşmüş olarak kendini yatağında buldu. Bir zırh kadar sert sırtının üzerine uzanmış, öylece duruyordu. Kafasını biraz kaldırıp baktığında, kahverengi bir kubbeyi andıran, boğum boğum olmuş ve tıpkı sırtı gibi sertleşmiş karnını gördü.",
      "available": true,
      "imgUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0000000064022-1.jpg",
      "paperType": "2. Hamur",
      "size": "13,5 x 21 cm",
      "printCount": 102,
      "publisher": "Can Yayınları"
    },
    {
      "id": "9",
      "title": "Beyaz Diş",
      "author": "Jack London",
      "year": 1906,
      "description": "Kendi cinsinden ve insanlardan nefret gördüğü, hiç durmadan onlarla mücadele ettiği için büyümesi çabuk fakat tek yönlü oluyordu. İçindeki şefkat ve sevginin filizlenmesi olanaksızdı. Böyle şeyler için en küçük bir umudu bile yoktu. Kuvvetliye boyun eğmek, zayıfı ezmek kuralını öğretmişti. Gri kunduz kuvvetli bir tanrıydı. Bu yüzden Beyaz Diş ona boyun eğiyordu. Fakat kendisinden küçük olan köpek, ezilmesi gereken zayıf bir yaratıktı. Onunki kuvvet yönünde bir gelişmeydi. Devamlı acı çekmek, hatta mahvolmak tehlikesine karşı koyabilmek için,m yırtıcı ve savunmacı özellikleri aşırı derecede gelişmişti. Diğer köpeklerden daha çabuk hareket ediyor, daha hızlı koşuyordu. Onlara oranla daha hileci, daha çevikti.",
      "available": true,
      "imgUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0000000347422-1.jpg",
      "paperType": "1. Hamur",
      "size": "12 x 19 cm",
      "printCount": 49,
      "publisher": "Aksöz Yayınevi"
    },
    {
      "id": "10",
      "title": "Simyacı",
      "author": "Paulo Coelho",
      "year": 1988,
      "description": "Simyacı, Brezilyalı eski şarkı sözü yazarı Paulo Coelho'nun, yayınlandığı 1988 yılından bu yana dünyayı birbirine katan, eleştirmenler tarafından bir `fenomen' olarak değerlendirilen üçüncü romanı. Simyacı, altı yılda kırk iki ülkede yedi milyondan fazla sattı. Bu, Gabriel Garcia Marquez'den bu yana görülmemiş bir olay. Yüreğinde, çocukluğunu yitirmemiş olan okurlar için bir `klasik' kimliği kazanan Simyacı'yı Saint-Exupery'nin Küçük Prens'i ve Richard Bach'ın Martı Jonathan Livingston'u ile karşılaştıranlar var (Publishers Weekly)..",
      "available": false,
      "imgUrl": "https://m.media-amazon.com/images/I/71aFt4+OTOL.jpg",
      "paperType": "2. Hamur",
      "size": "13,5 x 21 cm",
      "printCount": 121,
      "publisher": "Kılıç Yayınevi"
    },
    {
      "id": "11",
      "title": "Yabancı",
      "author": "Albert Camus",
      "year": 1942,
      "description": "Meursault, annesinin öldüğünü öğrendiği gün cenazeye katılmak üzere yola çıkar, hava çok sıcaktır. Gün boyu hissettikleri dış dünyaya ait uyarıcılardan öteye geçmez; sıcak, ışık onu rahatsız eder, dikkati kendi bedeni üzerindedir. Herkes ondan bir oğul olarak duygusal bir tepki beklerken o duyusal dünyaya dikkat kesilmiştir. Halbuki onun kayıtsızlığı, sadece annesinin ölümüyle ilgili değildir. Birkaç gün sonra ıssız bir kumsalda yürürken, onu telafi edilmez bir eylemde bulunmaya sevk edecek olan da aynı kayıtsızlıktır.",
      "available": true,
      "imgUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0000000064464-1.jpg",
      "paperType": "Şamua",
      "size": "13 x 20 cm",
      "printCount": 77,
      "publisher": "Can Yayınları"
    },
    {
      "id": "12",
      "title": "Momo",
      "author": "Michael Ende",
      "year": 1973,
      "description": "Momo, büyük bir kentin tiyatro harabelerinde yaşayan küçük bir kızdır. Buldukları ya da kendisine hediye edilenler dışında hiçbir şeyi yoktur. Ancak olağanüstü bir yeteneği vardır: Momo, muhteşem bir dinleyicidir ve bunun için oldukça bol zamanı vardır. Bir gün hayaletimsi topluluk “duman adamlar” ortaya çıkar. İnce hesaplı planlar kurup insanların zamanını çalarlar. Onları durduracak tek kişiyse Momo’dur. Momo elinde bir çiçek, koltuğunun altında bir kaplumbağa ve gizemli Hora Usta’nın da yardımıyla koskoca duman adamlar ordusunun karşısında tek başına durur. Acaba Momo, zamanı çalan adamları tek başına alt edebilecek midir? Toplumumuz ve günümüz insanının zaman algısı ve zamanı okuması üzerine bir masal olan Momo’yla Michael Ende, Alman Gençlik Edebiyatı Ödülü’ne layık görülmüştür. Pek çok kez sinemaya uyarlanan Momo, kırktan fazla dile çevrilmiş, tüm dünyada 7 milyonun üzerinde satılmıştır.",
      "available": true,
      "imgUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0001719390001-1.jpg",
      "paperType": "1. Hamur",
      "size": "16 x 24 cm",
      "printCount": 53,
      "publisher": "Kılıç Yayınevi"
    },
    {
      "id": "13",
      "title": "Martı Jonathan Livingston",
      "author": "Richard Bach",
      "year": 2015,
      "description": "Durgun denizin minik dalgacıkları üzerinde, güneşin altın gibi ışıldadığı pırıl pırıl bir sabahtı. Sahilden bir mil uzaklıkta, denizi kucaklarcasına ilerleyen bir balıkçı teknesi, martılara kahvaltı zamanının geldiğini haber veriyordu. Binlerce martı, bir lokma yiyecek için mücadeleye girişmişti bile. İşte zor bir gün daha başlıyordu.",
      "available": true,
      "imgUrl": "https://img.kitapyurdu.com/v1/getImage/fn:7528415/wh:true/wi:220",
      "paperType": "1. Hamur",
      "size": "13 x 19.5 cm",
      "printCount": 53,
      "publisher": "Aksöz Yayınevi"
    },
    {
      "id": "1741351908130",
      "title": "EEEE",
      "author": "DASD",
      "year": "1999",
      "description": "a",
      "available": true,
      "imgUrl": "A",
      "paperType": "A",
      "size": "a",
      "printCount": "2",
      "publisher": "YayinEviA"
    }
  ],
  "user": [
    {
      "id": "oZFgNJdGaCYorh7dTeof7D74BjX2",
      "email": "elakilic@gmail.com",
      "password": "elabela",
      "publisher": "Kılıç Yayınevi"
    },
    {
      "id": "rzuKMKbJFleoHhHwy0KZuTQoUFB2",
      "email": "emirhankorhan@gmail.com",
      "password": "emirhan",
      "publisher": "Can Yayınları"
    },
    {
      "id": "sATqzNtNWhULhjbJmMcrDsXacIv2",
      "email": "egemanaksoz@gmail.com",
      "password": "egemen",
      "publisher": "Aksöz Yayınevi"
    }
  ]
}
