{
    "posts": [
      {
        "baslik": "Yapay Zeka ve Günlük Hayatımız",
        "icerik": "Yapay zeka teknolojileri artık hayatımızın her alanında karşımıza çıkıyor. Akıllı telefonlardan ev aletlerine, sağlık hizmetlerinden eğitime kadar pek çok alanda AI destekli çözümler kullanılıyor...",
        "yazar": "Mehmet Yıldırım",
        "yayinTarihi": "2024-02-20",
        "resimUrl": "https://ornek.com/images/ai-daily-life.jpg"
      },
      {
        "baslik": "Sürdürülebilir Yaşam İçin Öneriler",
        "icerik": "Gezegenimizi korumak için günlük hayatımızda yapabileceğimiz küçük değişiklikler büyük fark yaratabilir. Plastik kullanımını azaltmak, enerji tasarrufu yapmak ve geri dönüşüme önem vermek bunlardan bazıları...",
        "yazar": "Zeynep Kaya",
        "yayinTarihi": "2024-02-19",
        "resimUrl": "https://ornek.com/images/sustainable-living.jpg"
      },
      {
        "baslik": "Modern Türk Mutfağından Lezzetler",
        "icerik": "Geleneksel Türk mutfağı, modern dokunuşlarla yeniden yorumlanıyor. Şefler, eski tarifleri günümüz damak zevkine uygun şekilde güncellerken, özünü korumaya özen gösteriyor...",
        "yazar": "Ayşe Şahin",
        "yayinTarihi": "2024-02-18",
        "resimUrl": "https://ornek.com/images/turkish-cuisine.jpg"
      },
      {
        "baslik": "Dijital Minimalizm",
        "icerik": "Teknoloji bağımlılığından kurtulmak ve dijital yaşamımızı sadeleştirmek için dijital minimalizm felsefesini benimseyebiliriz. Gereksiz uygulamaları silmek, bildirim sayısını azaltmak ve ekran süresini kontrol altına almak önemli adımlar...",
        "yazar": "Can Demir",
        "yayinTarihi": "2024-02-17",
        "resimUrl": "https://ornek.com/images/digital-minimalism.jpg"
      },
      {
        "baslik": "Doğa Fotoğrafçılığı İpuçları",
        "icerik": "Doğa fotoğrafçılığında başarılı kareler yakalamak için doğru ekipman kadar sabır ve teknik bilgi de önemlidir. Işığı doğru kullanmak, kompozisyon kurallarına dikkat etmek ve doğal yaşama saygılı olmak temel prensiplerdir...",
        "yazar": "Elif Yılmaz",
        "yayinTarihi": "2024-02-16",
        "resimUrl": "https://ornek.com/images/nature-photography.jpg"
      }
    ]
  }