{
    "books": [
      {
        "id": 1,
        "title": "1984",
        "author": "George Orwell",
        "year": 1949,
        "description": "1984, totaliter bir devletin vatandaşlarını nasıl sürekli gözetim altında tuttuğunu, bireysel özgürlüklerin nasıl baskılandığını ve gerçekliğin nasıl manipüle edildiğini anlatan çarpıcı bir distopya romanıdır. Büyük Birader’in her hareketi izlediği, düşünce polisinin bireyleri cezalandırdığı bu dünyada Winston Smith, gerçekleri sorgulamaya başlar ve özgürlüğünü kazanmak için mücadele eder.",
        "available": true
      },
      {
        "id": 2,
        "title": "Sapiens",
        "author": "Yuval Noah Harari",
        "year": 2011,
        "description": "Sapiens, insanlık tarihine geniş bir perspektiften bakan, avcı-toplayıcı dönemlerden günümüz modern toplumlarına kadar insanın nasıl evrimleştiğini anlatan bir başyapıttır. Harari, din, ekonomi, siyaset ve teknoloji gibi kavramları ele alarak Homo sapiens'in dünyayı nasıl şekillendirdiğini detaylı bir şekilde inceler.",
        "available": false
      },
      {
        "id": 3,
        "title": "Hayvan Çiftliği",
        "author": "George Orwell",
        "year": 1945,
        "description": "Hayvan Çiftliği, bir grup hayvanın, zalim insan sahiplerine başkaldırarak kendi yönetimlerini kurmalarını ve zamanla bu yönetimin nasıl yozlaştığını anlatan güçlü bir alegorik romandır. Orwell, bu kitapta totaliter rejimlerin yükselişini ve gücün kötüye kullanımını eleştirir.",
        "available": true
      },
      {
        "id": 4,
        "title": "Suç ve Ceza",
        "author": "Fyodor Dostoyevski",
        "year": 1866,
        "description": "Suç ve Ceza, fakir bir öğrenci olan Raskolnikov’un, topluma zarar verdiğini düşündüğü bir tefeciyi öldürmesi ve sonrasında yaşadığı psikolojik bunalımı konu alır. Vicdan azabı ve adalet kavramlarını derinlemesine işleyen bu roman, insan psikolojisinin karmaşıklığını gözler önüne serer.",
        "available": false
      },
      {
        "id": 5,
        "title": "Bilinmeyen Bir Kadının Mektubu",
        "author": "Stefan Zweig",
        "year": 1922,
        "description": "Bilinmeyen Bir Kadının Mektubu, hayatı boyunca tek taraflı bir aşkla bir adamı seven kadının, ölmeden önce ona yazdığı duygusal mektubu konu alır. Zweig, insan ruhunun derinliklerine inerek aşkın, takıntının ve özverinin trajik yüzünü ustalıkla anlatır.",
        "available": true
      },
      {
        "id": 6,
        "title": "Dönüşüm",
        "author": "Franz Kafka",
        "year": 1915,
        "description": "Dönüşüm, bir sabah uyandığında devasa bir böceğe dönüşen Gregor Samsa'nın hikayesini anlatan Kafka’nın en ünlü eserlerinden biridir. Bu kitap, bireyin toplum ve aile içindeki yerini, yabancılaşmayı ve varoluşsal sorgulamaları güçlü bir şekilde ele alır.",
        "available": true
      },
      {
        "id": 7,
        "title": "Kürk Mantolu Madonna",
        "author": "Sabahattin Ali",
        "year": 1943,
        "description": "Kürk Mantolu Madonna, Raif Efendi’nin geçmişte yaşadığı büyük bir aşkı anlatan hüzünlü bir romanıdır. Kitap, yalnızlık, bastırılmış duygular ve anlaşılamamanın getirdiği melankoliyi ustalıkla işler. Raif Efendi’nin kalbindeki derin aşkı ve Maria Puder ile yaşadığı özel ilişki okuyucuyu derinden etkiler.",
        "available": false
      },
      {
        "id": 8,
        "title": "Beyaz Diş",
        "author": "Jack London",
        "year": 1906,
        "description": "Beyaz Diş, yarı kurt yarı köpek olan Beyaz Diş’in vahşi doğada hayatta kalma mücadelesini ve insanlarla olan karmaşık ilişkisini anlatır. Jack London, doğa ile insan arasındaki etkileşimi ve hayvanların dünyasını ustalıkla gözler önüne serer.",
        "available": true
      },
      {
        "id": 9,
        "title": "Simyacı",
        "author": "Paulo Coelho",
        "year": 1988,
        "description": "Simyacı, Santiago adlı bir çobanın hayallerinin peşinden giderek hayatın anlamını keşfetmesini anlatan büyüleyici bir romandır. Paulo Coelho, kişisel gelişim ve kaderin insan hayatındaki rolü üzerine etkileyici bir hikaye sunar.",
        "available": false
      },
      {
        "id": 10,
        "title": "Yabancı",
        "author": "Albert Camus",
        "year": 1942,
        "description": "Yabancı, Meursault adındaki bir adamın hayata ve ölüme karşı kayıtsızlığını konu alan varoluşçu bir romandır. Camus, insanın absürd varoluşunu ve toplumsal normlara uyumsuzluğunu derin bir şekilde işler.",
        "available": true
      },
      {
        "id": 11,
        "title": "Momo",
        "author": "Michael Ende",
        "year": 1973,
        "description": "Momo, zamana hükmeden gri adamların, insanların zamanını çalarak onları sürekli meşgul ettikleri bir dünyayı anlatır. Küçük bir kız olan Momo, sahip olduğu özel yetenekleriyle bu düzeni değiştirmeye çalışır. Michael Ende, zamanın değerini ve modern toplumun hız takıntısını eleştiren büyüleyici bir hikaye sunar.",
        "available": true
      }
    ]
}